/*
2. Describe the difference between var, dynamic, and explicitly typed variables in Dart.

#(Dynamic) 
هو نمط بيانات يستطيع تخزين اي قيم من البيانات 
نص / ارقام / true | false 

#(var)
 var is keyword
 عند استخدامها تحدد نمط البيانات الموجودة في نفس سطر التعريف
 يجب اسناد قيمة للمتغير في نفس سطر التعريف لتحديد النمط الصحيح 
 في حال لم يتم اسناد قيمة للمتغير في سطر التعريف سكون نمط المتحول هو 
 dynamic

 #(String)
 نمط بيانات يستخدم لتخزين السلاسل النصية 

 #(int)
 نمط بيانات يستخدم لتخزين القيم العددية 

 #(double)
 نمط بيانات يستخدم لتخزين الارقام التي تحوي فاصلة اي اعداد عشرية 
 نستطيع اسناد القيم الصحيحة بشكل صريح 
 اي نستطيع اسناد القيمة 12 مثلا للمتغير فهو يعتبرها 12.0

#(bool)
هو نمط بيانات يقبل تخزين القيم المنطقية اي 
true | false 

#(num)
هو نمط بيانات يجمه بين 
int & double 
اي نستطيع تخزين الاعداد الصحيحة و الاعداد العشرية واي نوع من الاعداد في هذا النمط 
*/
